Repository: ahmedshikashaker/invest
Catalog: packages/onboarding/lib/src/l10n/arb/onboarding_*.arb
Languages: ar

# authWithPAciTitle
source: You need to authenticate with PACI first in order to unlock your onboarding steps
ar: يجب عليك المصادقة مع هويتي أولًا لفتح خطوات التسجيل الخاصة بك

# authWithPAciButton
source: Authenticate PACI
ar: المصادقة مع هويتي

source: Set up your profile
ar: قم بإعداد ملفك الشخصي

source: Share your details to get started
ar: شارك تفاصيلك للبدء

# stepsDescription
source: Take the first step towards growing your wealth,share your details to start investing with us
ar: اتخذ الخطوة الأولى نحو تنمية ثروتك، شارك تفاصيلك لبدء الاستثمار معنا

source: Continue to
ar: تابع إلى

source: Register
ar: تسجيل

# continueWord
source: Continue
ar: استمرار

source: Continue to the next step
ar: الانتقال إلى الخطوة التالية

source: Save and exit
ar: حفظ والخروج

# authorizeSharePersonalInformation
source: I authorize to share my personal information with KIB invest
ar: أُفوض بمشاركة معلوماتي الشخصية مع KIB invest

source: Upload the file
ar: تحميل الملف

# uploadComponentOptionCamera
source: Camera
ar: الكاميرا

# uploadComponentOptionFile
source: Files
ar: الملفات

# uploadComponentOptionGallery
source: Photo gallery
ar: الصور

source: Please enable camera permission
ar: يرجى تمكين إذن الكاميرا

source: Please enable photo permission
ar: يرجى تمكين إذن الصور

source: Apply
ar: تطبيق

source: Clear
ar: مسح

source: up to
ar: حتى

source: Complete
ar: إكمال

source: Completed
ar: إكتملت

source: Start
ar: بدء
