Repository: ahmedshikashaker/invest
Catalog: packages/authentication/lib/src/l10n/arb/authentication_*.arb
Languages: ar

# authenticationRegistrationTitleUserRegistration
source: User Registration
ar: تسجيل المستخدم

# authenticationRegistrationSubtitleStartProvidingYourDetails
source: Start providing your details, enter your email ID and choose your password
ar: ابدأ بإدخال بياناتك، أدخل بريدك الإلكتروني واختر كلمة المرور الخاصة بك

# authenticationRegistrationLabelEmail
source: Email ID
ar: البريد الإلكتروني

# authenticationRegistrationLabelPassword
source: Password
ar: كلمة المرور

# authenticationRegistrationLabelConfirmPassword
source: Confirm Password
ar: تأكيد كلمة المرور

# authenticationRegistrationButtonContinue
source: Continue
ar: متابعة

# authenticationRegistrationRequirementsTitle
source: Your password must contain:
ar: يجب أن تحتوي كلمة المرور على:

# authenticationRegistrationRequirementsLength
source: 8 to 20 characters
ar: 8 إلى 20 حرفًا

# authenticationRegistrationRequirementsUpperAndLowerAndNumberAndSpecialCharacter
source: One uppercase, one lowercase letter, one number and one special character
ar: حرف كبير، وحرف صغير، ورقم واحد، ورمز خاص واحد

# authenticationRegistrationRequirementsPasswordMatch
source: Must match the password and confirm password
ar: يجب أن تتطابق كلمة المرور وتأكيد كلمة المرور

# authenticationEmailOTPTitle
source: Enter the verification code
ar: أدخل رمز التحقق

# authenticationPersonalDetailsRegistrationTitleUserRegistration
source: User Registration
ar: تسجيل المستخدم

# authenticationPersonalDetailsRegistrationSutitleFillYourPersonalDetails
source: Fill in your personal details
ar: املأ بياناتك الشخصية

# authenticationPersonalDetailsRegistrationCivilId
source: Civil Id
ar: الرقم المدني

# authenticationPersonalDetailsRegistrationMobileNumber
source: Mobile number
ar: رقم الجوال

# authenticationPersonalDetailsRegistrationButtonContinue
source: Continue
ar: متابعة

# authenticationMobileNumberOTPTitle
source: Enter the verification code
ar: أدخل رمز التحقق

# authenticationRegistrationSuccessTitle
source: Congratulations You're all set!
ar: تهانينا تمت العملية بنجاح!

# authenticationRegistrationSuccessDescripation
source: You have successfully registered
ar: تم تسجيلك بنجاح

# authenticationRegistrationSuccessButton
source: Continue
ar: متابعة

source: Skip
ar: تخطي

source: Get started
ar: ابدأ الآن

# onBoardingTitle1
source: Invest the Shariah-Compliant Way
ar: استثمر بطريقة متوافقة مع الشريعة

# onBoardingTitle2
source: Secure, Flexible, Ethical
ar: آمن، مرن، أخلاقي

# onBoardingTitle3
source: Start your investment journey
ar: ابدأ رحلتك الاستثمارية

# onBoardingDescription1
source: Start your Shariah-compliant journey with stable and secure returns.
ar: ابدأ رحلتك المتوافقة مع الشريعة بعوائد مستقرة وآمنة.

# onBoardingDescription2
source: Flexible, ethical investments that preserve and grow your wealth.
ar: استثمارات مرنة وأخلاقية تحافظ على ثروتك وتنميها.

# onBoardingDescription3
source: Open your account and make your first investment in just a few simple steps.
ar: افتح حسابك وقم بأول استثمار لك في بضع خطوات بسيطة.

source: Login
ar: تسجيل الدخول

source: Explore investment opportunities
ar: استكشف فرص الاستثمار

source: Never used online KIB Invest before?
ar: لم تستخدم KIB Invest عبر الإنترنت من قبل؟

source: Register now
ar: سجل الآن

source: Login details
ar: تفاصيل تسجيل الدخول

source: Please enter your Email ID and password
ar: يرجى إدخال بريدك الإلكتروني وكلمة المرور

source: Email ID
ar: البريد الإلكتروني

source: Password
ar: كلمة المرور

source: Forgot password?
ar: هل نسيت كلمة المرور؟

# paciAuthenticationFailedTitle
source: Authentication Failed
ar: لم تتم المصادقة بنجاح

# paciAuthenticationFailedDescription
source: Your PACI authentication request has been rejected
ar: تم رفض طلب المصادقه من تطبيق هويتي الخاص بك

# paciAuthHeader
source: Authorize Kuwait Mobile ID
ar: المصادقة باستخدام تطبيق هويتي

# reAuthPaciHeader
source: Re-Authenticate
ar: إعادة المصادقة

# paciAuthSuccessTitle
source: PACI authentication was successful
ar: تمت المصادقة بنجاح على تطبيق هويتي

# paciAuthSuccessDesc
source: Please review your information and continue to complete the onboarding process.
ar: يرجى التحقق من معلوماتك و المتابعة لإتمام عملية التسجيل.

# continueTitle
source: Continue
ar: استمرار

# englishNameTitle
source: Name in English
ar: الاسم بالإنجليزية

# arabicNameTitle
source: Name in Arabic
ar: الاسم بالعربية

# civilIdTitle
source: Civil ID
ar: الرقم المدني

# civilIdExpiryDateTitle
source: Civil ID expiry date
ar: تاريخ انتهاء صلاحية البطاقة المدني

# dateOfBirthTitle
source: Date of birth
ar: تاريخ الميلاد

# nationalityTitle
source: Nationality
ar: الجنسية

# genderTitle
source: Gender
ar: الجنس

# addressTitle
source: Address
ar: العنوان

# openPaciAndAcceptTitle
source: Please open the app and accept the request under
ar: يرجى فتح التطبيق والموافقة على الطلب المصادقة

# authPaciAndSignTitle
source: 'Authenticate & Sign' tab
ar: 'المصادقة و التوقيع'

# paciAuthRequestSentTitle
source: An authentication request has been submitted to your Kuwait Mobile ID app and is awaiting your verification.
ar: تم إرسال طلب المصادقة إلى تطبيق هويتي الخاص بك وهو في انتظار التحقق منك.

# paciAuthExpiresInTitle
source: Authentication request expires in
ar: تنتهي صلاحية طلب المصادقة خلال

# didYouForgotPassword
source: Forgot password?
ar: هل نسيت كلمة المرور؟

source: Civil id
ar: الرقم المدني

source: Please enter your civil ID and phone number
ar: يرجى إدخال الرقم المدني ورقم الهاتف

# buttonContinue
source: continue
ar: متابعة

source: Mobile number
ar: رقم الهاتف

source: Reset password
ar: إعادة تعيين كلمة المرور

source: Confirm Password
ar: تأكيد كلمة المرور

source: Password must at least be:
ar: يجب أن تكون كلمة المرور على الأقل:

# passwordLength
source: 8 to 20 characters
ar: من 8 إلى 20 حرفًا

# validPassword
source: One uppercase, one lowercase letter, one number and one special character
ar: حرف كبير، حرف صغير، رقم، وحرف خاص واحد على الأقل

# passwordMatching
source: Must match the password and confirm password
ar: يجب أن تتطابق كلمة المرور مع تأكيد كلمة المرور

# congratulationsYouAllSet
source: Congratulations, youâ€™re all set!
ar: مبروك، لقد تم الإعداد بنجاح!

source: Your password has been updated
ar: تم تحديث كلمة المرور الخاصة بك
