Repository: ahmedshikashaker/invest
Catalog: packages/funds/lib/src/l10n/arb/funds_*.arb
Languages: ar

# investmentsProductsTitle
source: Investment products
ar: المنتجات الاستثمارية

# fundManagerTitle
source: Fund manager
ar: مدير الصندوق الاستثماري

# minimumInvestmentTitle
source: Minimum investment
ar: الحد الأدنى للمساهمة

# liquidityTitle
source: Liquidity
ar: السيولة المالية

# inceptionDateTitle
source: Inception date
ar: تاريخ الإطلاق

# navTitle
source: NAV
ar: صافي قيمة الأصول

# navDateTitle
source: NAV date
ar: تاريخ تقييم صافي الأصول

# annualizedWeekReturnTitle
source: Annualized 1 week return
ar: العائد السنوي لمدة أسبوع

source: Return since inception
ar: العائد التراكمي منذ التأسيس

# navPriceTitle
source: Nav price
ar: سعر الوحدة الاستثمارية

# highlightsTitle
source: Highlights
ar: المميزات

# featuresTitle
source: Features
ar: الخصائص

# articlesAssociationTitle
source: Articles of Association(AoA)
ar: النظام الأساسي للصندوق الاستثماري

# factSheetTitle
source: Fact sheet
ar: لائحة الحقائق

# termsAndConditionsTitle
source: Terms and conditions
ar: الشروط و الأحكام

# registerNowTitle
source: Register now
ar: اشترك الآن

# kibInvestFundsTitle
source: KIB Invest Funds
ar: صناديق KIB للاستثمار

# minInvestmentTitle
source: Min. investment
ar: أدنى قيمة استثمارية

# annualizedWeekTitle
source: Annualized 1 week
ar: العائد السنوي للأسبوع

# fundsUnavailableEmptyStateTitle
source: Funds unavailable
ar: الصناديق الاستثمارية غير متوفرة

# fundsUnavailableEmptyStateDesc
source: List of funds are currently unavailable
ar: القائمة الاستثمارية غير متاحة في الوقت الحالي
